import React, { useEffect } from "react";
import { useNavigate } from "react-router-dom";
import { User2, Star, TrendingUp, ClipboardList, FileText, X } from "lucide-react";

const EmployeePopup = ({ employee, onClose, onSelect }) => {
  const atten=(<svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="40" height="40" rx="20" fill="#410A5F"/>
<path d="M17.1429 9.5V11H22.8571V9.5C22.8571 8.67172 23.4955 8 24.2857 8C25.0759 8 25.7143 8.67172 25.7143 9.5V11H27.8571C29.0402 11 30 12.0073 30 13.25V15.5H10V13.25C10 12.0073 10.9594 11 12.1429 11H14.2857V9.5C14.2857 8.67172 14.9241 8 15.7143 8C16.5045 8 17.1429 8.67172 17.1429 9.5ZM10 17H30V29.75C30 30.9922 29.0402 32 27.8571 32H12.1429C10.9594 32 10 30.9922 10 29.75V17ZM13.5714 20C13.1768 20 12.8571 20.3375 12.8571 20.75V23.75C12.8571 24.1625 13.1768 24.5 13.5714 24.5H26.4286C26.8214 24.5 27.1429 24.1625 27.1429 23.75V20.75C27.1429 20.3375 26.8214 20 26.4286 20H13.5714Z" fill="white"/>
</svg>
)
const perfor=(<svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="40" height="40" rx="20" fill="#410A5F"/>
<path d="M24.5012 24.795C25.1566 24.4159 25.323 23.3869 25.8551 22.8549C26.3871 22.3228 27.4161 22.1574 27.7954 21.5016C28.1695 20.8552 27.8032 19.8826 28.0004 19.1443C28.1906 18.4295 28.9594 17.7732 28.9594 16.9998C28.9594 16.2264 28.1498 15.5692 27.959 14.8563C27.7618 14.118 28.1283 13.1454 27.7544 12.499C27.3753 11.8437 26.3466 11.6777 25.8145 11.1457C25.2824 10.6137 25.1165 9.58481 24.4611 9.2056C23.8146 8.83159 22.8419 9.19793 22.1035 9.00053C21.4306 8.80952 20.7743 8 20.0008 8C19.2273 8 18.571 8.80952 17.8584 9.00029C17.1177 9.19716 16.1473 8.83108 15.4994 9.20466C14.8441 9.58388 14.6781 10.6128 14.146 11.1443C13.6144 11.6763 12.5849 11.8423 12.2057 12.4976C11.8316 13.1421 12.1982 14.1171 12.0008 14.853C11.8096 15.5702 11 16.2264 11 16.9998C11 17.7732 11.8096 18.4304 12.0004 19.1434C12.1976 19.8816 11.8309 20.8543 12.2048 21.5007C12.5845 22.156 13.613 22.32 14.1446 22.8544C14.6767 23.3864 14.8427 24.4153 15.4985 24.795C16.145 25.169 17.1172 24.8024 17.8556 24.9998C18.571 25.1887 19.2273 25.9996 20.0008 25.9996C20.7743 25.9996 21.4315 25.1901 22.145 24.9994C22.8838 24.8044 23.8542 25.17 24.5012 24.795ZM16.2504 16.9998C16.2504 14.9247 17.9292 13.2499 20.0008 13.2499C22.0724 13.2499 23.7511 14.9247 23.7511 16.9998C23.7511 19.0703 22.0724 20.7498 20.0008 20.7498C17.9292 20.7498 16.2504 19.0717 16.2504 16.9998ZM11.0805 28.3059C10.9282 28.6897 10.9971 29.1252 11.2622 29.4426C11.5274 29.7589 11.9434 29.9065 12.3461 29.8245L14.4645 29.401L15.4691 31.3823C15.6626 31.7652 16.0442 31.9995 16.4708 31.9995C16.4869 31.9995 16.5019 31.999 16.518 31.9983C16.9634 31.9807 17.3454 31.7132 17.5137 31.3008L19.0879 27.4533C16.5701 27.2359 14.3063 26.1352 12.6092 24.4557L11.0805 28.3059ZM27.3889 24.4575C25.6943 26.137 23.43 27.2376 20.9102 27.4551L22.4844 31.3025C22.6529 31.7149 23.0348 31.9822 23.4802 32C23.498 31.9573 23.4745 31.9995 23.5308 31.9995C23.9571 31.9995 24.3385 31.7664 24.5317 31.3836L25.5363 29.4018L27.6547 29.8253C28.0576 29.9073 28.4737 29.7597 28.7386 29.4433C29.0037 29.1262 29.0726 28.6905 28.9203 28.3067L27.3889 24.4575Z" fill="white"/>
</svg>
)
const tasks=(<svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="40" height="40" rx="20" fill="#410A5F"/>
<path fill-rule="evenodd" clip-rule="evenodd" d="M20.5922 31.2584L20.5802 31.2604L20.5092 31.2954L20.4892 31.2994L20.4752 31.2954L20.4042 31.2594C20.3936 31.2568 20.3856 31.2588 20.3802 31.2654L20.3762 31.2754L20.3592 31.7034L20.3642 31.7234L20.3742 31.7364L20.4782 31.8104L20.4932 31.8144L20.5052 31.8104L20.6092 31.7364L20.6212 31.7204L20.6252 31.7034L20.6082 31.2764C20.6056 31.2658 20.6002 31.2598 20.5922 31.2584ZM20.8562 31.1454L20.8422 31.1474L20.6582 31.2404L20.6482 31.2504L20.6452 31.2614L20.6632 31.6914L20.6682 31.7034L20.6762 31.7114L20.8772 31.8034C20.8899 31.8068 20.8996 31.8041 20.9062 31.7954L20.9102 31.7814L20.8762 31.1674C20.8729 31.1548 20.8662 31.1474 20.8562 31.1454ZM20.1412 31.1474C20.1368 31.1448 20.1315 31.1439 20.1265 31.145C20.1215 31.1461 20.1171 31.1491 20.1142 31.1534L20.1082 31.1674L20.0742 31.7814C20.0749 31.7934 20.0806 31.8014 20.0912 31.8054L20.1062 31.8034L20.3072 31.7104L20.3172 31.7024L20.3202 31.6914L20.3382 31.2614L20.3352 31.2494L20.3252 31.2394L20.1412 31.1474Z" fill="#F8F8F8"/>
<path fill-rule="evenodd" clip-rule="evenodd" d="M14.843 10.15C14.5338 10.8756 14.3745 11.6586 14.375 12.45C14.375 13.06 14.6121 13.645 15.034 14.0763C15.456 14.5077 16.0283 14.75 16.625 14.75H23.375C23.9717 14.75 24.544 14.5077 24.966 14.0763C25.3879 13.645 25.625 13.06 25.625 12.45C25.625 11.6323 25.4585 10.8538 25.157 10.15H26.75C27.3467 10.15 27.919 10.3923 28.341 10.8237C28.7629 11.255 29 11.84 29 12.45V29.7C29 30.31 28.7629 30.895 28.341 31.3263C27.919 31.7577 27.3467 32 26.75 32H13.25C12.6533 32 12.081 31.7577 11.659 31.3263C11.2371 30.895 11 30.31 11 29.7V12.45C11 11.84 11.2371 11.255 11.659 10.8237C12.081 10.3923 12.6533 10.15 13.25 10.15H14.843ZM20 22.8H16.625C16.3266 22.8 16.0405 22.9212 15.8295 23.1368C15.6185 23.3525 15.5 23.645 15.5 23.95C15.5 24.255 15.6185 24.5475 15.8295 24.7632C16.0405 24.9788 16.3266 25.1 16.625 25.1H20C20.2984 25.1 20.5845 24.9788 20.7955 24.7632C21.0065 24.5475 21.125 24.255 21.125 23.95C21.125 23.645 21.0065 23.3525 20.7955 23.1368C20.5845 22.9212 20.2984 22.8 20 22.8ZM23.375 18.2H16.625C16.3383 18.2003 16.0625 18.3126 15.854 18.5138C15.6455 18.715 15.52 18.99 15.5032 19.2826C15.4864 19.5752 15.5795 19.8633 15.7635 20.0881C15.9476 20.3129 16.2086 20.4573 16.4934 20.492L16.625 20.5H23.375C23.6734 20.5 23.9595 20.3788 24.1705 20.1632C24.3815 19.9475 24.5 19.655 24.5 19.35C24.5 19.045 24.3815 18.7525 24.1705 18.5368C23.9595 18.3212 23.6734 18.2 23.375 18.2ZM20 9C20.4748 9.00001 20.9443 9.10245 21.3778 9.30061C21.8113 9.49878 22.1989 9.78821 22.5155 10.15C22.997 10.6997 23.3075 11.4069 23.3649 12.1878L23.375 12.45H16.625C16.625 11.6162 16.9141 10.8515 17.3956 10.2558L17.4845 10.15C18.1033 9.4439 19.001 9 20 9Z" fill="white"/>
</svg>
)
const requests=(<svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="40" height="40" rx="20" fill="#410A5F"/>
<path d="M27 11.022C27 11.014 27 11.008 27 11V9C27 8.73478 26.8946 8.48043 26.7071 8.29289C26.5196 8.10536 26.2652 8 26 8C25.7348 8 25.4804 8.10536 25.2929 8.29289C25.1054 8.48043 25 8.73478 25 9V10.1C24.6709 10.0332 24.3358 9.99966 24 10H23V9C23 8.73478 22.8946 8.48043 22.7071 8.29289C22.5196 8.10536 22.2652 8 22 8C21.7348 8 21.4804 8.10536 21.2929 8.29289C21.1054 8.48043 21 8.73478 21 9V10H19V9C19 8.73478 18.8946 8.48043 18.7071 8.29289C18.5196 8.10536 18.2652 8 18 8C17.7348 8 17.4804 8.10536 17.2929 8.29289C17.1054 8.48043 17 8.73478 17 9V10H16C15.6642 9.99966 15.3291 10.0332 15 10.1V9C15 8.73478 14.8946 8.48043 14.7071 8.29289C14.5196 8.10536 14.2652 8 14 8C13.7348 8 13.4804 8.10536 13.2929 8.29289C13.1054 8.48043 13 8.73478 13 9V11V11.022C12.3808 11.4844 11.8777 12.0845 11.5306 12.775C11.1834 13.4654 11.0018 14.2272 11 15V27C11.0016 28.3256 11.5289 29.5964 12.4662 30.5338C13.4036 31.4711 14.6744 31.9984 16 32H24C25.3256 31.9984 26.5964 31.4711 27.5338 30.5338C28.4711 29.5964 28.9984 28.3256 29 27V15C28.9982 14.2272 28.8166 13.4654 28.4694 12.775C28.1223 12.0845 27.6192 11.4844 27 11.022ZM20 25H16C15.7348 25 15.4804 24.8946 15.2929 24.7071C15.1054 24.5196 15 24.2652 15 24C15 23.7348 15.1054 23.4804 15.2929 23.2929C15.4804 23.1054 15.7348 23 16 23H20C20.2652 23 20.5196 23.1054 20.7071 23.2929C20.8946 23.4804 21 23.7348 21 24C21 24.2652 20.8946 24.5196 20.7071 24.7071C20.5196 24.8946 20.2652 25 20 25ZM24 21H16C15.7348 21 15.4804 20.8946 15.2929 20.7071C15.1054 20.5196 15 20.2652 15 20C15 19.7348 15.1054 19.4804 15.2929 19.2929C15.4804 19.1054 15.7348 19 16 19H24C24.2652 19 24.5196 19.1054 24.7071 19.2929C24.8946 19.4804 25 19.7348 25 20C25 20.2652 24.8946 20.5196 24.7071 20.7071C24.5196 20.8946 24.2652 21 24 21ZM24 17H16C15.7348 17 15.4804 16.8946 15.2929 16.7071C15.1054 16.5196 15 16.2652 15 16C15 15.7348 15.1054 15.4804 15.2929 15.2929C15.4804 15.1054 15.7348 15 16 15H24C24.2652 15 24.5196 15.1054 24.7071 15.2929C24.8946 15.4804 25 15.7348 25 16C25 16.2652 24.8946 16.5196 24.7071 16.7071C24.5196 16.8946 24.2652 17 24 17Z" fill="white"/>
</svg>
)
  const navigate = useNavigate();
  if (!employee) return null;

  // 🟢 دالة الحذف
  const handleDelete = async () => {
    if (window.confirm("هل أنت متأكد من حذف هذا الموظف؟")) {
      try {
        const res = await fetch(`http://localhost:4000/api/hr/deleteEmployee/${employee.id}`, {
          method: "DELETE",
        });

        if (res.ok) {
          alert("تم حذف الموظف بنجاح ✅");
          onClose(); 
          navigate("/employees"); 
          window.location.reload()
        } else {
          alert("حدث خطأ أثناء الحذف ❌");
        }
      } catch (error) {
        console.error(error);
        alert("فشل الاتصال بالسيرفر ❌");
      }
    }
  };

  useEffect(() => {
    const onKey = (e) => e.key === "Escape" && onClose?.();
    window.addEventListener("keydown", onKey);
    return () => window.removeEventListener("keydown", onKey);
  }, [onClose]);

  return (
    <div
      className="fixed inset-0 z-50 flex items-center justify-center bg-black/40"
      onClick={onClose}
    >
      <div
        className="w-[750px] max-w-[95vw] bg-white rounded-2xl p-6 shadow-xl flex flex-col gap-6 relative"
        onClick={(e) => e.stopPropagation()}
        dir="rtl"
      >
        {/* زر الإغلاق */}
        <button
          onClick={onClose}
          className="absolute top-4 left-4 text-[#410A5F] hover:text-[#6b4591]"
        >
          <X size={22} />
        </button>

        {/* بيانات الموظف */}
        <div className="flex items-center justify-between">
          <div className="flex items-center gap-3">
            <img
              src="https://static.vecteezy.com/system/resources/previews/026/619/142/original/default-avatar-profile-icon-of-social-media-user-photo-image-vector.jpg"
              alt="صورة الموظف"
              className="w-12 h-12  object-cover "
            />
            <div className="text-right text-[#410A5F]">
              <h2 className="text-lg font-bold">{employee.name}</h2>
              <p className="text-sm">
                <span className="font-semibold">المسمى الوظيفي:</span>{" "}
                {employee.job}
              </p>
              <p className="text-sm">
                <span className="font-semibold">القسم:</span>{" "}
                {employee.department}
              </p>
              <p className="text-sm">
                <span className="font-semibold">تاريخ الانضمام:</span>{" "}
                {employee.startDate}
              </p>
            </div>
          </div>
        </div>

        {/* الأيقونات القديمة */}
        <div className="grid grid-cols-4 rounded-xl overflow-hidden gap-3">
          <div
            className="flex flex-col items-center rounded-[16px] justify-center py-4 gap-3 cursor-pointer"
            style={{ backgroundColor: "#FF98311A" }}
            onClick={() => navigate(`/employees/${employee.id}/attendance`)}
          >
            {atten}
            <span className="text-sm text-[#410A5F]">الحضور</span>
          </div>

          <div
            className="flex flex-col items-center rounded-[16px] justify-center py-4 gap-3 cursor-pointer"
            style={{ backgroundColor: "#FF98311A" }}
          >
            {perfor}
            <span className="text-sm text-[#410A5F]">التقييم والاداء</span>
          </div>

          <div
            onClick={() => onSelect("tasks")}
            className="flex flex-col items-center rounded-[16px] justify-center py-4 gap-3 cursor-pointer"
            style={{ backgroundColor: "#FF98311A" }}
          >
          {tasks}
            <span className="text-sm text-[#410A5F]">المهام</span>
          </div>

          <div
            onClick={() => onSelect("requests")}
            className="flex flex-col items-center rounded-[16px] justify-center py-4 gap-3 cursor-pointer"
            style={{ backgroundColor: "#FF98311A" }}
          >
           {requests}
            <span className="text-sm text-[#410A5F]">الطلبات</span>
          </div>
        </div>

        {/* الأزرار */}
        <div className="flex flex-col gap-3">
          <button
            className="w-full py-2 bg-[#FF9831] text-white rounded-2xl font-bold hover:bg-[#cc7a28] transition-colors"
            onClick={() => navigate(`/editemployee/${employee.id}`)}
          >
            تعديل البيانات
          </button>
          <button
            onClick={handleDelete}
            className="w-full py-2 border border-[#FF9831] text-[#FF9831] rounded-2xl font-bold hover:bg-[#FF98311A] transition-colors"
          >
            إزالة الموظف
          </button>
        </div>
      </div>
    </div>
  );
};

export default EmployeePopup;
