import QuickInfoCard from "../components/QuickInfoCard";
import ProgressCard from "../components/ProgressCard";
import CommercialTable from "../components/CommercialTable";
import RequestsTable from "../components/RequestsTable";
import AttendanceTable from "../components/AttendanceTable";
import { useEffect, useState } from "react";
import axios from "axios";
export default function HomePage() {
  const icon1 = (
    <svg width="35" height="35" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="40" height="40" rx="20" fill="#410A5F"/>
<path d="M9 26C8.71667 26 8.47933 25.904 8.288 25.712C8.09667 25.52 8.00067 25.2827 8 25V24.425C8 23.7083 8.36667 23.125 9.1 22.675C9.83333 22.225 10.8 22 12 22C12.2167 22 12.425 22.0043 12.625 22.013C12.825 22.0217 13.0167 22.0423 13.2 22.075C12.9667 22.425 12.7917 22.7917 12.675 23.175C12.5583 23.5583 12.5 23.9583 12.5 24.375V26H9ZM15 26C14.7167 26 14.4793 25.904 14.288 25.712C14.0967 25.52 14.0007 25.2827 14 25V24.375C14 23.8417 14.146 23.354 14.438 22.912C14.73 22.47 15.1423 22.0827 15.675 21.75C16.2077 21.4173 16.8453 21.1673 17.588 21C18.3307 20.8327 19.1347 20.7493 20 20.75C20.8833 20.75 21.696 20.8333 22.438 21C23.18 21.1667 23.8173 21.4167 24.35 21.75C24.8827 22.0833 25.291 22.471 25.575 22.913C25.859 23.355 26.0007 23.8423 26 24.375V25C26 25.2833 25.9043 25.521 25.713 25.713C25.5217 25.905 25.284 26.0007 25 26H15ZM27.5 26V24.375C27.5 23.9417 27.446 23.5333 27.338 23.15C27.23 22.7667 27.0673 22.4083 26.85 22.075C27.0333 22.0417 27.221 22.021 27.413 22.013C27.605 22.005 27.8007 22.0007 28 22C29.2 22 30.1667 22.221 30.9 22.663C31.6333 23.105 32 23.6923 32 24.425V25C32 25.2833 31.904 25.521 31.712 25.713C31.52 25.905 31.2827 26.0007 31 26H27.5ZM12 21C11.45 21 10.9793 20.8043 10.588 20.413C10.1967 20.0217 10.0007 19.5507 10 19C10 18.4333 10.196 17.9583 10.588 17.575C10.98 17.1917 11.4507 17 12 17C12.5667 17 13.0417 17.1917 13.425 17.575C13.8083 17.9583 14 18.4333 14 19C14 19.55 13.8083 20.021 13.425 20.413C13.0417 20.805 12.5667 21.0007 12 21ZM28 21C27.45 21 26.9793 20.8043 26.588 20.413C26.1967 20.0217 26.0007 19.5507 26 19C26 18.4333 26.196 17.9583 26.588 17.575C26.98 17.1917 27.4507 17 28 17C28.5667 17 29.0417 17.1917 29.425 17.575C29.8083 17.9583 30 18.4333 30 19C30 19.55 29.8083 20.021 29.425 20.413C29.0417 20.805 28.5667 21.0007 28 21ZM20 20C19.1667 20 18.4583 19.7083 17.875 19.125C17.2917 18.5417 17 17.8333 17 17C17 16.15 17.2917 15.4377 17.875 14.863C18.4583 14.2883 19.1667 14.0007 20 14C20.85 14 21.5627 14.2877 22.138 14.863C22.7133 15.4383 23.0007 16.1507 23 17C23 17.8333 22.7127 18.5417 22.138 19.125C21.5633 19.7083 20.8507 20 20 20Z" fill="#F8F8F8"/>
</svg>
  )
    const icon2=(<svg width="35" height="35" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="40" height="40" rx="20" fill="#410A5F"/>
<path d="M14.0417 19.0833C12.2725 19.0833 10.8333 17.6442 10.8333 15.875C10.8333 14.1058 12.2725 12.6667 14.0417 12.6667C15.8108 12.6667 17.25 14.1058 17.25 15.875C17.25 17.6442 15.8108 19.0833 14.0417 19.0833ZM25.5 20C22.4622 20 20 22.4622 20 25.5C20 28.5378 22.4622 31 25.5 31C28.5378 31 31 28.5378 31 25.5C31 22.4622 28.5378 20 25.5 20ZM26.0674 27.7128C25.7209 28.0593 25.2607 28.25 24.7713 28.25H24.7694C24.2799 28.25 23.8197 28.0584 23.4742 27.7119L21.6298 25.8676L22.926 24.5714L24.7713 26.4167L28.085 23.1029L29.3812 24.3991L26.0674 27.7128ZM23.2083 15.4167C21.4392 15.4167 20 13.9775 20 12.2083C20 10.4392 21.4392 9 23.2083 9C24.9775 9 26.4167 10.4392 26.4167 12.2083C26.4167 13.9775 24.9775 15.4167 23.2083 15.4167ZM20.253 20.3777C21.5849 19.0137 23.443 18.1667 25.5 18.1667C26.4616 18.1667 27.3801 18.3518 28.2216 18.6883C28.0291 17.3582 26.8823 16.3333 25.5 16.3333H20.9167C19.5756 16.3333 18.4563 17.2986 18.2153 18.5709C19.0632 18.9541 19.7736 19.5884 20.253 20.3777ZM16.3333 20H11.75C10.2338 20 9 21.2338 9 22.75V25.5H18.1667C18.1667 24.2708 18.4692 23.113 19.0036 22.0955C18.7093 20.8947 17.624 20 16.3333 20Z" fill="#F8F8F8"/>
</svg>
)
const icon3=(<svg width="35" height="35" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="40" height="40" rx="20" fill="#410A5F"/>
<path d="M24.5834 18.1667C23.3143 18.1667 22.0737 18.543 21.0184 19.2481C19.9632 19.9531 19.1408 20.9553 18.6551 22.1278C18.1695 23.3003 18.0424 24.5905 18.29 25.8352C18.5376 27.0799 19.1487 28.2232 20.0461 29.1206C20.9435 30.018 22.0868 30.6291 23.3315 30.8767C24.5762 31.1243 25.8664 30.9972 27.0389 30.5116C28.2114 30.0259 29.2135 29.2035 29.9186 28.1482C30.6237 27.093 31 25.8524 31 24.5833C30.9981 22.8821 30.3214 21.2511 29.1185 20.0482C27.9155 18.8453 26.2846 18.1686 24.5834 18.1667ZM27.0648 27.0647C26.8929 27.2366 26.6597 27.3331 26.4167 27.3331C26.1736 27.3331 25.9405 27.2366 25.7686 27.0647L23.9353 25.2314C23.7633 25.0595 23.6667 24.8264 23.6667 24.5833V21.8333C23.6667 21.5902 23.7633 21.3571 23.9352 21.1852C24.1071 21.0132 24.3402 20.9167 24.5834 20.9167C24.8265 20.9167 25.0596 21.0132 25.2315 21.1852C25.4034 21.3571 25.5 21.5902 25.5 21.8333V24.2038L27.0648 25.7686C27.2366 25.9405 27.3331 26.1736 27.3331 26.4167C27.3331 26.6597 27.2366 26.8928 27.0648 27.0647ZM16.7679 19.0833C15.7707 19.0833 14.796 18.7876 13.9669 18.2337C13.1378 17.6797 12.4916 16.8923 12.11 15.971C11.7284 15.0498 11.6286 14.0361 11.8231 13.0581C12.0176 12.0801 12.4978 11.1818 13.2029 10.4767C13.908 9.77158 14.8063 9.29141 15.7843 9.09688C16.7623 8.90234 17.776 9.00218 18.6972 9.38378C19.6185 9.76537 20.4059 10.4116 20.9599 11.2407C21.5138 12.0698 21.8095 13.0445 21.8095 14.0417C21.8081 15.3784 21.2764 16.6599 20.3312 17.6051C19.3861 18.5502 18.1046 19.0819 16.7679 19.0833ZM19.4097 31H9.91672C9.79549 31 9.67546 30.976 9.56358 30.9293C9.45171 30.8826 9.3502 30.8141 9.26495 30.728C9.1797 30.6418 9.11239 30.5395 9.06692 30.4271C9.02145 30.3148 8.99872 30.1945 9.00006 30.0732C8.99583 28.1715 9.56741 26.313 10.6396 24.7422C11.7118 23.1715 13.2343 21.9621 15.007 21.2732C15.7109 21.0231 16.4546 20.9038 17.2015 20.9213C17.0539 21.2173 16.9241 21.5219 16.8128 21.8333C16.4953 22.7154 16.3331 23.6459 16.3334 24.5833C16.3337 25.8149 16.6102 27.0306 17.1426 28.1411C17.675 29.2516 18.4497 30.2286 19.4097 31Z" fill="#F8F8F8"/>
</svg>
)
const icon4=(<svg width="35" height="35" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="40" height="40" rx="20" fill="#410A5F"/>
<path d="M25.5 20C22.4668 20 20 22.4668 20 25.5C20 28.5333 22.4668 31 25.5 31C28.5333 31 31 28.5333 31 25.5C31 22.4668 28.5333 20 25.5 20ZM29.1667 25.5C29.1667 26.1783 28.9687 26.8053 28.6469 27.3507L23.6493 22.3522C24.1947 22.0304 24.8217 21.8324 25.5 21.8324C27.5222 21.8324 29.1667 23.4778 29.1667 25.5ZM21.8333 25.5C21.8333 24.8217 22.0313 24.1947 22.3531 23.6493L27.3507 28.6478C26.8053 28.9696 26.1783 29.1676 25.5 29.1676C23.4778 29.1676 21.8333 27.5222 21.8333 25.5ZM11.75 14.5C11.75 11.4668 14.2168 9 17.25 9C20.2832 9 22.75 11.4668 22.75 14.5C22.75 17.5332 20.2832 20 17.25 20C14.2168 20 11.75 17.5332 11.75 14.5ZM20.6609 31H9V26.4167C9 23.8858 11.0524 21.8333 13.5833 21.8333H19.1558C18.5306 22.9132 18.1667 24.1626 18.1667 25.5C18.1667 27.6936 19.1347 29.6562 20.6609 31Z" fill="#F8F8F8"/>
</svg>
)
const [attendanceData, setAttendanceData] = useState(null);
const [stats, setStats] = useState(null);

useEffect(() => {
  const fetchAttendance = async () => {
    try {
      const res = await axios.get("http://localhost:4000/api/attendance/dailyState", {
        withCredentials: true, // إرسال الكوكيز
      });

      setAttendanceData(res.data); // مباشرة من res.data
      console.log(res.data);

    } catch (err) {
      console.error("خطأ في جلب بيانات الحضور:", err);
    }
  };

  fetchAttendance();
}, []);

useEffect(() => {
  const fetchStats = async () => {
    try {
      const res = await axios.get("http://localhost:4000/api/hr/getContractsStats", {
        withCredentials: true,
      });
      setStats(res.data);
    } catch (err) {
      console.error("خطأ في جلب إحصائيات العقود والإقامات:", err);
    }
  };

  fetchStats();
}, []);

  return (
    <div className="h-screen overflow-hidden px-4 py-2 space-y-3">
      {/* --- القسم الأول: المعلومات السريعة + الحضور --- */}
       {/* --- القسم الأول: المعلومات السريعة + الحضور --- */}
      <div className="flex flex-col lg:flex-row gap-3 min-h-[20%]">
        {/* الكروت */}
        <div className="flex-1 bg-[#E9E8E84D] rounded-xl p-3">
          <h2 className="text-sm font-bold mb-2 text-[#410A5F]">معلومات سريعة</h2>
          <div className="grid grid-cols-2 md:grid-cols-4 gap-2">
            <QuickInfoCard
              icon={icon1}
              title="عدد الموظفين"
              value={attendanceData ? attendanceData.totalEmployees : "--"}
            />
            <QuickInfoCard
              icon={icon2}
              title="الحاضرين"
              value={attendanceData ? attendanceData.present : "--"}
            />
            <QuickInfoCard
              icon={icon3}
              title="المتأخرين"
              value={attendanceData ? attendanceData.late : "--"}
            />
            <QuickInfoCard
              icon={icon4}
              title="الغائبين"
              value={
                attendanceData
                  ? attendanceData.absentWithExcuse + attendanceData.absentWithoutExcuse
                  : "--"
              }
            />
          </div>
        </div>

        {/* Progress Card */}
        <div
          className="relative w-full lg:w-1/3 rounded-xl p-3 shadow flex flex-col"
          style={{ backgroundColor: "#E9E8E84D" }}
        >
          <div className="absolute bottom-0 left-0 w-[80px] h-[80px] bg-[#410A5F0D] rounded-tr-full"></div>
          <h2 className="text-sm font-bold mb-2 text-[#410A5F]">الحضور والانصراف</h2>
          <ProgressCard data={attendanceData} />
        </div>
      </div>

      {/* --- القسم الثاني: العقود + الإقامات + السجلات --- */}
   <div className="grid grid-cols-1 lg:grid-cols-12 gap-3 h-[25%] min-h-0">
     {/* كارت الإقامات */}
<div
  style={{ backgroundColor: "#E6E6E64D" }}
  className="lg:col-span-2 rounded-xl p-3 shadow flex flex-col text-xs items-right"
>
  <h2 className="text-sm font-bold text-[#410A5F] mb-2">الإقامات</h2>
  {/* الأيقونة تحت العنوان */}
  <svg width="32" height="32" viewBox="0 0 40 41" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect y="0.5" width="40" height="40" rx="20" fill="#410A5F"/>
<g clip-path="url(#clip0_89_9891)">
<path d="M15.5 21.5C14.61 21.5 13.74 21.2361 12.9999 20.7416C12.2599 20.2472 11.6831 19.5443 11.3425 18.7221C11.0019 17.8998 10.9128 16.995 11.0865 16.1221C11.2601 15.2492 11.6887 14.4474 12.318 13.818C12.9474 13.1887 13.7492 12.7601 14.6221 12.5865C15.495 12.4128 16.3998 12.502 17.2221 12.8425C18.0443 13.1831 18.7471 13.7599 19.2416 14.4999C19.7361 15.24 20 16.11 20 17C19.9987 18.1931 19.5241 19.3369 18.6805 20.1805C17.8369 21.0241 16.6931 21.4987 15.5 21.5ZM23 28.5C22.9984 27.1744 22.4711 25.9036 21.5338 24.9662C20.5964 24.0289 19.3256 23.5016 18 23.5H13C11.6744 23.5016 10.4036 24.0289 9.46622 24.9662C8.52888 25.9036 8.00159 27.1744 8 28.5L8 32.5H23V28.5ZM25.5 17.5C24.61 17.5 23.74 17.2361 22.9999 16.7416C22.2599 16.2471 21.6831 15.5443 21.3425 14.7221C21.0019 13.8998 20.9128 12.995 21.0865 12.1221C21.2601 11.2492 21.6887 10.4474 22.318 9.81802C22.9474 9.18869 23.7492 8.7601 24.6221 8.58647C25.495 8.41283 26.3998 8.50195 27.2221 8.84254C28.0443 9.18314 28.7471 9.75991 29.2416 10.4999C29.7361 11.24 30 12.11 30 13C29.9987 14.1931 29.5241 15.3369 28.6805 16.1805C27.8369 17.0241 26.6931 17.4987 25.5 17.5ZM27 19.5H22C21.8245 19.5081 21.6496 19.5257 21.476 19.553C21.1124 20.3943 20.5754 21.1494 19.9 21.769C21.3663 22.1839 22.6574 23.0654 23.5777 24.28C24.498 25.4946 24.9973 26.9761 25 28.5H32V24.5C31.9984 23.1744 31.4711 21.9036 30.5338 20.9662C29.5964 20.0289 28.3256 19.5016 27 19.5Z" fill="#F8F8F8"/>
</g>
<defs>
<clipPath id="clip0_89_9891">
<rect width="24" height="24" fill="white" transform="translate(8 8.5)"/>
</clipPath>
</defs>
</svg>

  <div className="grid grid-cols-2 gap-2 text-center flex-1 w-full mt-3">
    <div>
      <span className="text-[#410A5F] block">مستمرة</span>
      <span className="font-bold">
          {stats ? stats.residencies.active : "--"}
      </span>
    </div>
    <div>
      <span className="text-[#410A5F] block">قرب الانتهاء</span>
      <span className="font-bold">
          {stats ? stats.residencies.expiringSoon : "--"}
      </span>
    </div>
  </div>
</div>

{/* كارت العقود */}
<div
  style={{ backgroundColor: "#E6E6E64D" }}
  className="lg:col-span-2 rounded-xl p-3 shadow flex flex-col text-xs items-right"
>
  <h2 className="text-sm font-bold text-[#410A5F] mb-2">العقود</h2>
  {/* الأيقونة تحت العنوان */}
  <svg width="32" height="32" viewBox="0 0 40 41" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect y="0.5" width="40" height="40" rx="20" fill="#410A5F"/>
<g clip-path="url(#clip0_89_9882)">
<path d="M27 8.5H13C10.24 8.5 8 10.74 8 13.5V27.5C8 30.26 10.24 32.5 13 32.5H27C29.76 32.5 32 30.26 32 27.5V13.5C32 10.74 29.76 8.5 27 8.5ZM14 13.5H20C20.55 13.5 21 13.95 21 14.5C21 15.05 20.55 15.5 20 15.5H14C13.45 15.5 13 15.05 13 14.5C13 13.95 13.45 13.5 14 13.5ZM14 17.5H23C23.55 17.5 24 17.95 24 18.5C24 19.05 23.55 19.5 23 19.5H14C13.45 19.5 13 19.05 13 18.5C13 17.95 13.45 17.5 14 17.5ZM17 27.5H14C13.45 27.5 13 27.05 13 26.5C13 25.95 13.45 25.5 14 25.5H17C17.55 25.5 18 25.95 18 26.5C18 27.05 17.55 27.5 17 27.5ZM26 23.5H14C13.45 23.5 13 23.05 13 22.5C13 21.95 13.45 21.5 14 21.5H26C26.55 21.5 27 21.95 27 22.5C27 23.05 26.55 23.5 26 23.5Z" fill="#F8F8F8"/>
</g>
<defs>
<clipPath id="clip0_89_9882">
<rect width="24" height="24" fill="white" transform="translate(8 8.5)"/>
</clipPath>
</defs>
</svg>

  <div className="grid grid-cols-2 gap-2 text-center flex-1 w-full  mt-3">
    <div>
      <span className="text-[#410A5F] block">نشطة</span>
      <span className="font-bold">
              {stats ? stats.contracts.active : "--"}
      </span>
    </div>
    <div>
      <span className="text-[#410A5F] block">قرب الانتهاء</span>
      <span className="font-bold">
              {stats ? stats.contracts.expiringSoon : "--"}
      </span>
    </div>
  </div>
</div>


      {/* جدول السجلات */}
      <div
        style={{ backgroundColor: "#E6E6E64D" }}
        className="relative lg:col-span-8 rounded-xl shadow p-2 overflow-y-auto custom-scrollbar h-full min-h-0"
      >
        <div className="absolute top-0 left-0 w-[60px] h-[60px] bg-[#410A5F0D] rounded-br-full"></div>
        <CommercialTable />
      </div>
    </div>

      {/* --- القسم الثالث: الطلبات + الحضور --- */}
    <div className="grid grid-cols-12 gap-3 h-[30%] min-h-0">
  {/* الطلبات */}
  <div className="col-span-8 flex flex-col min-h-0">
    <div className="bg-[#E6E6E64D] rounded-xl shadow p-2 flex-1 overflow-y-auto custom-scrollbar min-h-0">
      <RequestsTable />
    </div>
  </div>

  {/* الحضور */}
  <div className="col-span-4 flex flex-col min-h-0">
    <div className="bg-[#E6E6E64D] rounded-xl shadow p-2 flex-1 overflow-y-auto custom-scrollbar min-h-0">
      <AttendanceTable />
    </div>
  </div>
</div>

    </div>
  );
}
